{
  "catalogItems": [
    {
      "itemId": 1,
      "name": "American ultra",
      "viewType": 1,
      "primaryDescription": "American ultra is our most advance series of guitars and basses for discerning players who demand the ultimate in precision,performance and tone.",
      "secondaryDescription": "The American Ultra Stratocaster HSS features a unique \"Modern D\" neck profile with Ultra rolled fingerboard edges for hours of playing comfort, and the tapered neck helll allows easy access to the highest register.",
      "firstPicture": "catalog/catalog1/image1.png",
      "secondPicture": "catalog/catalog1/image2.png",
      "thirdPicture": "catalog/catalog1/image3.png"
    },
    {
      "itemId": 2,
      "name": "Catalog2",
      "viewType": 2,
      "primaryDescription": "Other features include sealed locking tuning machines, chrome hardware and bone nut. Includes premium molded hardshell case.  Slim with wide shoulders, the modern D neck profile works for any style of playing. Ultra rolled fingerboard edges and a silky, smmoth ultra satin finish make the neck effortless to play.",
      "secondaryDescription": "Built for speed and easy bending, the 10\"-14\" compound-radius fingerboard is rounded near the nut for chording ease, becoming increasingly flatter as it nears the upper register for easy scoring. The tapered neck heel allows unparallel access to the upper registers of the fingerboard, while the sculpted read body contour is designed for comfort.",
      "firstPicture": "catalog/catalog2/image1.png",
      "secondPicture": "catalog/catalog2/image2.png",
      "thirdPicture": "catalog/catalog2/image3.png"
    },
    {
      "itemId": 3,
      "name": "Ultra Noiseless Hot",
      "viewType": 3,
      "primaryDescription": "The Ultra Noiseless Hot single-coil pickups offer modern Fender tone without hum. In conjution with the Ultra Double Tap humbucking bridge pickup this calibrated set is supremely versatile and offers dynamic Fender tone that is second to none.",
      "secondaryDescription": "The volume knob's S-1 switch splits the Ultra Double tap humbucking pickup inot a full throated single-coil, perfectly calibrated with the neck and middle pickups, thansk to patented Double tap technology. A high performance feature, locking tuning machines offers increased tuning stability while making strings changes fast and easy.",
      "firstPicture": "catalog/catalog3/image1.png",
      "secondPicture": "catalog/catalog3/image2.png"
    },
    {
      "itemId": 4,
      "name": "Catalog4",
      "viewType": 4,
      "primaryDescription": "Some solid-bodied guitars, such as the Gibson Les Paul Supreme, the PRS Singlecut, and the Fender Telecaster Thinline, are built with hollow chambers in the body. These chambers are designed to not interfere with the critical bridge and string anchor point on the solid body.",
      "secondaryDescription": "The bridge and tailpiece, while serving separate purposes, work closely together to affect playing style and tone. There are four basic types of bridge and tailpiece systems on electric guitars. Within these four types are many variants. A hard-tail guitar bridge anchors the strings at or directly behind the bridge and is fastened securely to the top of the instrument.",
      "firstPicture": "catalog/catalog4/image1.png",
      "secondPicture": "catalog/catalog4/image2.png",
      "thirdPicture": "catalog/catalog4/image3.png"
    },
    {
      "itemId": 5,
      "name": "Catalog5",
      "viewType": 1,
      "primaryDescription": "The most recent electric guitar on this list is the Ibanez Jem (1987) which featured '24 frets', 'an impossibly thin neck' and was 'designed to be the ultimate shredder machine'.",
      "secondaryDescription": "Another notable solid-body design is the Fender Stratocaster, which was introduced in 1954 & became  popular among musicians in the 1960s - 1970s for its wide tonal capabilities & more comfortable ergonomics than other models.",
      "firstPicture": "catalog/catalog5/image1.png",
      "secondPicture": "catalog/catalog5/image2.png",
      "thirdPicture": "catalog/catalog5/image3.png"
    },
    {
      "itemId": 6,
      "name": "Catalog6",
      "viewType": 3,
      "primaryDescription": "Frets are positioned proportionally to scale length—the shorter the scale length, the closer the fret spacing. Opinions vary regarding the effect of scale length on tone and feel.   Popular opinion holds that longer scale length contributes to greater amplitude..",
      "secondaryDescription": "Reports of playing feel are greatly complicated by the many factors involved in this perception. String gauge and design, neck construction and relief, guitar setup, playing style, and other factors contribute to the subjective impression of playability or feel. Aside from possible engineering advantages, some feel that with the rising cost of rare tonewoods, man-made materials may be economically preferable and more ecologically sensitive.",
      "firstPicture": "catalog/catalog6/image1.png",
      "secondPicture": "catalog/catalog6/image2.png"
    },
    {
      "itemId": 7,
      "name": "Catalog7",
      "viewType": 3,
      "primaryDescription": "The Ultra Noiseless Hot single-coil pickups offer modern Fender tone without hum. In conjution with the Ultra Double Tap humbucking bridge pickup this calibrated set is supremely versatile and offers dynamic Fender tone that is second to none.",
      "secondaryDescription": "The volume knob's S-1 switch splits the Ultra Double tap humbucking pickup inot a full throated single-coil, perfectly calibrated with the neck and middle pickups, thansk to patented Double tap technology. A high performance feature, locking tuning machines offers increased tuning stability while making strings changes fast and easy.",
      "firstPicture": "catalog/catalog7/image1.png",
      "secondPicture": "catalog/catalog7/image2.png"
    },
    {
      "itemId": 8,
      "name": "Catalog8",
      "viewType": 5,
      "primaryDescription": "Electric guitars are used in many styles of music including rock, blues, country, jazz, funk, and more. Electric guitars feature pickups and electronics that turn the vibration of the strings into an electrical signal that is then sent to a guitar amplifier. Some popular electric guitars include the Fender Stratocaster and Telecaster, and the Gibson Les Paul and SG. Electric guitars come in many forms like solidbody, semi-hollowbody, or hollowbody guitars. Each guitar body offers sonic differences that should be considered before you buy.",
      "firstPicture": "catalog/catalog8/image1.png"
    }
  ]
}